'''
    *
  * *     
* * *
  * *
    *  
'''
'''
      *
    * *
  * * *     
* * * *
  * * *
    * *  
      *
'''

'''
  *
* *     
  *
'''

n = int(input('enter how many stars do you want?> '))
i = 0
j = 2
while i < n:
    if i < n/2:
        print(' '*(n-2*i-1) + '* '*(i+1))

    else:
        print(' '*(j) + '* '*(n-i))
        j += 2

    i += 1


# exercise 1:
'''
اردوی مدرسه

ورودی برنامه : تعداد دانش آموزان داوطلب
خروجی برنامه : هزینه اردو برای هر دانش آموز


توضیحات :
هزینه پذیرایی برای هر نفر 5
هزینه ورودی برای هر نفر 20
کرایه دربست برای هر ون 150
ظرفیت هر ون 10 نفر
اگر یک ون پر نشود کرایه دربست باید پرداخت شود.



'''


# exercise2:

'''
می خواهیم یک گروه کوهنوردی تشکیل دهیم با شرایط زیر

اول : سن داوطلب نباید کمتر از 15 باشد
دوم : قد داوطلب نباید کمتر از 150 باشد
در صورت غیر مجاز بودن داوطلب پیغام مناسبی نمایش داده شود.

به این نکنه توجه کن که در صورت نداشتن سن مجاز پیغام مناسب داده شود ودیگر قد داوطلب سوال نشود.

'''
